Show / Hide Table of Contents
Class ConnectionSetup
ConnectionSetup
Inheritance
System.Object
ConnectionSetup
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel
Assembly: IdeaRS.OpenModel.dll
Syntax
public class ConnectionSetup
Constructors
Improve this Doc   View Source
ConnectionSetup()
Constructor
Declaration
public ConnectionSetup()
Properties
Improve this Doc   View Source
AlphaCC
Long-term effect on fcd
Declaration
public double AlphaCC { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
AnalysisGNL
Analysis with GNL
Declaration
public bool AnalysisGNL { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
AnchorLengthForStiffness
Length of anchor to define the anchor stiffness in analysis model, as a multiple of anchor diameter (E A /n * [d])
Declaration
public int AnchorLengthForStiffness { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
ApplyBearingCheck
ApplyBearingCheck
Declaration
public bool ApplyBearingCheck { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
ApplyBetapInfluence
Apply βp influence in bolt shear resistance. ΕΝ 1993-1-8 chapter 3.6.1 (12)
Declaration
public bool ApplyBetapInfluence { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
ApplyConeBreakoutCheck
Apply cone breakout check
Declaration
public ConeBreakoutCheckType ApplyConeBreakoutCheck { get; set; }
Property Value
 Type |  Description
 ConeBreakoutCheckType
Improve this Doc   View Source
BaseMetalCapacity
BaseMetalCapacity
Declaration
public bool BaseMetalCapacity { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
BearingAngle
Load distribution angle of concrete block in calculation of factor Kj
Declaration
public double BearingAngle { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
BearingCheck
Apply bearing check including αb
Declaration
public bool BearingCheck { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
BoltMaxGripLengthCoeff
Max value of bolt grip
Declaration
public double BoltMaxGripLengthCoeff { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
BracedSystem
Consider the frame system as braced for stiffness calculation. Braced system reduces horizontal displacements.
Declaration
public bool BracedSystem { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
ConcreteSetup
Concrete setup
Declaration
[Obsolete]
public ConcreteSetup ConcreteSetup { get; set; }
Property Value
 Type |  Description
 ConcreteSetup
Improve this Doc   View Source
CrackedConcrete
True if cracked concrete is considered
Declaration
public bool CrackedConcrete { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
CrtCompCheckIS
Crt check type
Declaration
public CrtCompCheckIS CrtCompCheckIS { get; set; }
Property Value
 Type |  Description
 CrtCompCheckIS
Improve this Doc   View Source
DecreasingFtrd
Decreasing Ftrd of anchors. Worse quality influence
Declaration
public double DecreasingFtrd { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
DistanceBetweenBolts
Limit distance between bolts as a multiple of bolt diameter
Declaration
public double DistanceBetweenBolts { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
DistanceBetweenBoltsEdge
Limit distance between bolt and plate edge as a multiple of bolt diameter
Declaration
public double DistanceBetweenBoltsEdge { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
DistanceDiameterBetweenBP
Anchor pitch
Declaration
public double DistanceDiameterBetweenBP { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
DivisionOfArcsOfRHS
Number of straight lines to substitute corner arc of rectangular tubes in analysis model
Declaration
public int DivisionOfArcsOfRHS { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
DivisionOfSurfaceOfCHS
Number of straight lines to substitute circle of circular tube in analysis model
Declaration
public int DivisionOfSurfaceOfCHS { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
EffectiveAreaStressCoeff
Effective area is taken from intersection of stress area and area of joined items according to EN1993-1-8 art. 6.2.5
Declaration
public double EffectiveAreaStressCoeff { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
ExtensionLengthRationCloseSections
ExtensionLengthRationCloseSections
Declaration
public double ExtensionLengthRationCloseSections { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
ExtensionLengthRationOpenSections
ExtensionLengthRationOpenSections
Declaration
public double ExtensionLengthRationOpenSections { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
FactorPreloadBolt
FactorPreloadBolt
Declaration
public double FactorPreloadBolt { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
FatigueSectionOffset
Fatigue section Offset = FatigueSectionOffset x Legsize
Declaration
public double FatigueSectionOffset { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
FrictionCoefficient
Coefficient of friction between base plate and concrete block
Declaration
public double FrictionCoefficient { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
FrictionCoefficientPbolt
Friction factor of slip-resistant joint
Declaration
public double FrictionCoefficientPbolt { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
GammaC
Partial safety factor of concrete
Declaration
public double GammaC { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
GammaInst
Partial safety factor of instalation safety
Declaration
public double GammaInst { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
GammaM3
Preloaded bolts safety factor
Declaration
public double GammaM3 { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
CheckDetailing
Perform check of bolt positions
Declaration
public bool CheckDetailing { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
JointBetaFactor
Joint coefficient βj - Used for Fjd calculation
Declaration
public double JointBetaFactor { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
LimitDeformation
Limit deformation on closed sections
Declaration
public double LimitDeformation { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
LimitDeformationCheck
Limit deformation on closed sections check or not
Declaration
public bool LimitDeformationCheck { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
LimitPlasticStrain
Limit of plastic strain used in 2D plate element check
Declaration
public double LimitPlasticStrain { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
MaxSize
Maximal size of generated finite mesh element
Declaration
public double MaxSize { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Mdiv
Number of iteration steps to evaluate analysis divergence
Declaration
public int Mdiv { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
MemberLengthRatio
A multiple of cross-section height to determine the default length of member
Declaration
public double MemberLengthRatio { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
MinSize
Minimal size of generated finite mesh element
Declaration
public double MinSize { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
NumberIterations
More iterations helps to find better solutions in contact elements but increases calculation time
Declaration
public int NumberIterations { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
NumElement
Ratio of length of decisive plate edge and Elements on edge count determines the average size of mesh element
Declaration
public int NumElement { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
NumElementRhs
Number of mesh elements in RHS height
Declaration
public int NumElementRhs { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
OptimalCheckLevel
Optimal check level
Declaration
public double OptimalCheckLevel { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
PretensionForceFpc
Pretension force fpc = k * fub * As
Declaration
public double PretensionForceFpc { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
RigidBP
True if rigid base plate is considered
Declaration
public bool RigidBP { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
SteelSetup
Steel Setup
Declaration
public SteelSetup SteelSetup { get; set; }
Property Value
 Type |  Description
 SteelSetup
Improve this Doc   View Source
StopAtLimitStrain
Stop analysis when the limit strain is reached.
Declaration
public bool StopAtLimitStrain { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
WarnCheckLevel
Warning check level
Declaration
public double WarnCheckLevel { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
WarnPlasticStrain
Warning plastic strain
Declaration
public double WarnPlasticStrain { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
WeldEvaluationData
Method of evaluation of stress in welds
Declaration
public WeldEvaluation WeldEvaluationData { get; set; }
Property Value
 Type |  Description
 WeldEvaluation
Methods
Improve this Doc   View Source
InitByCode()
Inicialize by setted code
Declaration
public void InitByCode()
 Improve this Doc
 View Source